'''
Begin1
Дана сторона квадрата a
Найти его периметр P = 4a
'''
print ("Begin1\n"
       "вычисление периметра квадрата по его стороне")
a = input("Введите длину стороны квадрата: ")
p = 4 * int(a)
print("Длина стороны квадрата: " + a)
print("Периметр квадрата: " + str(p))