'''
Begin2
Дана сторона квадрата. Найти его площадь
S = a^2
'''
print("Begin2\n"
      "Вычисление площади квадрата по его стороне\n\n")
a = input("Введите длину стороны квадрата: ")
s = int(a) ** 2
print("Длина стороны квадрата: " + str(a))
print("Площадь квадрата: " + str(s))